<template>
  <section class="overflow-hidden bg-gray-50 sm:grid sm:grid-cols-2">
    <img
      alt="Student"
      src="/piano.jpg"
      class="sm:hidden block h-56 w-full object-cover sm:h-full"
    />
    <div class="p-8 md:p-12 lg:px-16 lg:py-24">
      <div class="mx-auto max-w-xl text-justify ltr:sm:text-left rtl:sm:text-right">
        <h2 class="text-2xl font-bold text-gray-900 md:text-3xl">Обо мне:</h2>

        <p class="text-gray-500 md:mt-4 md:block">
          Во времена прохождения обучения в университете, являлся организатором, а также
          преподавателем в локальной дополнительной школе по математике/информатике/олимпиадным
          задачам для учеников школьного возраста. Неплохо владею JavaScript, в частности React JS,
          Vue Js, а также знаком с такими языками программирования, как: C++, PHP, Java, помимо
          этого с SQL, HTML, CSS, и др. В частности реализовывал дипломную работу по теме дискретной
          математики и числовые методы на C++. Из достижений в учебной деятельности стоит выделить,
          аттестат с отличием за 11 классов, диплом бакалавра с отличием, первое место в городской
          олимпиаде по математике среди учеников 6-7 классов, г Улан-Удэ, первое место в олимпиаде
          по математике среди студентов ИМИ БГУ, участие в международной олимпиаде по математике в
          Монголии, г. Улан-Батор и пр. Во время студенчества часто проявлял участие в общественной
          и творческой жизни, где можно выделить: призер всероссийского фестиваля "Студенческая
          весна", двукратный чемпион республики Бурятия и чемпион Иркутской области по битбоксу,
          командир линейного студенческого отряда в г. Ялта. <br /><b>Личные качества:</b>
          обучаемость, усидчивость, психологическая устойчивость, коммуникабельность, аналитическое
          мышление, сильная математическая база, амбициозность, самокритичность, ответственность.
        </p>
      </div>
    </div>
    <img
      alt="Student"
      src="/piano.jpg"
      class="sm:block hidden h-56 w-full object-cover sm:h-full"
    />
  </section>
</template>
